[
  {
    "name": "Getting Started",
    "contentSections": [
      {
        "title": "Set up",
        "description": "The first thing you will need in order to do a skate 2 speedrun is a console on which you can run the game, and if you want to submit the run a means of recording your game.\n In terms of consoles, there are several key differences. Modern playstations do not support skate 2, so the only playstation console which will support the game is the PS3. Alternatively, RPCS3 can be used, although will be hidden by default on the leaderboards, since it is not an official release of the game.\n All Xbox consoles since Xbox 360 support the game, however the game is no longer digitally for sale. This means that if your console does not support physical disks you will need to already have the digital game owned on your account in order to use it.\n Timing your run is not required, although may be useful as a tool. The time of the run can be calculated from the complete recording of the game. The recording must include the game audio and complete, unbroken footage of the game. You can achieve this either by using a capture card, or by directly recording the screen on which you're playing the game."
      },
      {
        "title": "Game settings",
        "description": "When setting up your character in the game, you can configure the character however you like. The time to set up the character does not count towards the run.\n It's recommended to turn off the music from within the audio settings, since the music within the game is copyrighted and some platforms for uploading the video will mute the audio. This isn't a requirement however as long as a full audio version of the run is available in some way to the moderators when verifying the run.\nYou can also update the camera angle, if you prefer high camera, before beginning the run."
      }
    ]
  },
  {
    "name": "General Tricks",
    "contentSections": [
      {
        "title": "Speed glitch",
        "description": "There is one key speed glitch used within the skate 2 run, in order to achieve it you need to first pop a trick into the air (ideally an ollie). Once in the air, grab the board backside, this will be left trigger if in regular stance or right trigger if in goofy stance. Then press the %y% button to begin getting off the board (while still holding the trigger). As you begin to get off the board, you press %y% again to get back on the board in such a way that the board is angled as you contact the floor.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=WwkoduYX1qV2uykq&amp;clip=Ugkx-IpkX5oyUwP1Qv-MMJFxPoh4V78HZYe0&amp;clipt=EMguGO91"
      },
      {
        "title": "Tri-pushing",
        "description": "Everyone knows that it takes three pushes to get to max speed, but did you know you can push quicker than just holding the %a% or %x% button? When we move the right analog stick with all other buttons neutral, our skater quickly gets into position ready to perform a trick. We can use this faster return to the neutral stance in between pushes to push at almost double the speed. As soon as you have gained the full benefit of a push, flick the analog stick to return to the neutral position and push again",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=54hwrbiuWMoVsiiM&amp;clip=UgkxorK8CxMWKJRi3M-elIeBPTxBAGiNbKKK&amp;clipt=EMbKIxjO8SM"
      },
      {
        "title": "Fast Pause",
        "description": "During the game, your game will save at multiple points. You can see that the game has saved because we get an orange spinner and a message saying 'saving content'. One of the most egregious cases of this from a speedrun perspective is after challenge completion. We will complete many challenges during the course of the speedrun, and while the spinner is saving we are not allowed to perform some actions; such as pausing the game.\nA way to circumvent this is to perform a fast pause. This trick is not yet particularly consistent, but the goal is to pause between a challenge ending and the pause spinner appearing. The window for this is extremely small, so requires very fast input between the %a% press to remove the challenge completion screen and the pause press. When it works, you will be in the menu while the save spinner saves the game.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=_MD2xsDC-PJRXTv-&amp;clip=UgkxAwMmtYNZ37RFho74T7DtlDDyOSqXYhiV&amp;clipt=EKf9Ihis1yM"
      }
    ]
  },
  {
    "name": "Challenges",
    "contentSections": [
      {
        "title": "Go meet slappy + tricks",
        "description": "This intro section is very simple, the key is to get to slappy's park as fast as possible. You can use the speed glitch to speed up how fast you get there. It's also possible (very rarely) to skip one of the cutscenes at the top of the stairs, a consistent method of achieving this is yet to be found.\n When grabbing the dumpster, make sure you turn both sticks to the right to spin the dumpster around yourself and move your foot into the cutscene zone at the top of slappy's park.\nOn the tricks, you can start the ollie a little bit quicker if you hold a manual as you begin the challenge then pop out of it.",
        "videoUrl": "https://www.youtube.com/embed/OfDqnh38f70?si=Aw-5xco4t-oMASuW"
      },
      {
        "title": "No Mugshots Please",
        "description": "This challenge is super simple, just push a couple of times and then grind the rail - be careful not to push too much and grind too little - that won't count for the challenge completion. When you finish try to line up to skate around the rail towards just get up there"
      },
      {
        "title": "Just get up there",
        "description": "In this challenge the game expects us to skate down, move the ramp, then skate again over to jump up onto the top of the box. We can instead take a tight angle as we hit the kicker and pop up onto the top of the box. If you hit a grind, you may still survive even hitting the barrel on the top. Try to skate off the other end towards the exit of the park for the next challenge.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=qhH3crCpNebVuv9l&amp;clip=Ugkxs2pbiwtOVDO88ikzaONDZgkVojiD1DX3&amp;clipt=EMiKCBiA8wg"
      },
      {
        "title": "Follow Slappy",
        "description": "Not a lot special for this challenge, in any% you can set up the quarter pipe ready for dunk slam later, however this won't work in career 100%. Sometimes slappy can bail at the bottom of the tunnel, so be careful as it's easy to fail. Slappy has two routes after the tunnel he may choose, keep an eye on whether he goes left or right and try to stay closer to that side into the end."
      },
      {
        "title": "School's Out",
        "description": "You can tri-push to start this challenge a little quicker, try to make sure you roll towards the start point of School of hard knocks (directly in front of the set at the end of this challenge) to arrive there quicker."
      },
      {
        "title": "School of Hard Knocks",
        "description": "Start by tri-pushing and then footplant on the dumpsters, so we don't need to waste time moving a ramp. If you didn't make the distance you may need to footplant again. It is just barely possible to clear the dumpsters without footplanting, although you also aren't allowed to grind them, so to achieve this you have to double grab and rotate to an angle which stops your skater from locking in a grind on the dumpster.",
        "videoUrl": "https://clips.twitch.tv/embed?clip=DarlingCrepuscularPenguinKappaPride&parent=expireddata.github.io"
      },
      {
        "title": "Skipping School",
        "description": "In this split, you need to do grabs while airing into/over the banks. There's multiple different strategies to complete this challenge. The trick to doing this challenge quickly is to try to keep as high speed as possible and avoid going up/down the ramps (since that loses speed). If you pick a very straight line through  you can hit 4 very quickly, while also managing to end with a faster load to the next challenge.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=vc8_lb0NneNv8RVm&amp;clip=UgkxausnUgmL3_v5F-PN2Fc7RRFgNao_5HrG&amp;clipt=EPylERjanRI"
      },
      {
        "title": "Playing Hooky",
        "description": "This challenge is probably the first more difficult one within the run, and is an easy way to lose a lot of time. The only requirement is that for each flat part of the ledge you are touch it in a manual. You are not allowed to grind, nor drop the manual, nor skip a ledge. With two regular pushes, it's possble to manual and pop the downward sections, be careful you don't line up for a grind.\nAn alternative easier strategy is to go down in a switch manual, as this is less likely to bottom out and end the manual when going down the downward sloped sections",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=0aBmC1yNHu_ACMsb&amp;clip=UgkxW0VmYJrVkWO51k0PZ-h3TbfynRq26rv3&amp;clipt=EJ6BFBjZthQ"
      },
      {
        "title": "School's In",
        "description": "Simple challenge again, be careful you go far enough to the side of the rails when aiming to lock in, if you are very straight on sometimes the grind will bug and not lock you on properly. Note that you can't pop out of the last grind and kick the board away, like you can in many other challenges."
      },
      {
        "title": "Pools",
        "description": "Now in the run we go to unlock the first 3 pools to be allowed into the thrasher party. To do this, first visit the thrasher pool party and get told you aren't cool enough. Then go to Challenge Map > Locations > Landmarks > Top of urban rez. This will put you in a prime place to pick up two of the pools. Skate down the hill (you can tri-push/speed glitch to speed this up), at the bottom set a session marker then turn right. Sneak between the fence and the building, being very careful not to bail here and pick up the community pool.\nReturn to your session marker and skate down to the Do-Drop Inn pool, be careful when you drop down that you are not going to fast to get over the curb, ideally you take the small gap between the ledge and the dumpster to get there as fast as possible.\nLastly we open the challenge map and then *x* to show completed challenges, warp to Film > School's out, quit the challenge and go right to get to the GED pool.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=Ow1Qbf9S14y1e5Qv&amp;clip=UgkxdkChoZWu7z-U-0mM86iY_tDbxrm9TMt9&amp;clipt=EOvmGRjLux0"
      },
      {
        "title": "A little help here",
        "description": "After you claim the last pool, wait for an interface to pop up offering to take you to the thrasher pool party again. Say yes! You can then go and start this challenge. The trick is to use the bowl to pump to get air, try to get air far enough away from the balcony that surrounds the pools left and far edge as you may air out and catch on it if you don't.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=arxUCf3lmC3kKc0z&amp;clip=UgkxuzM6j_7vpmvKfD4aeEJURCA8X8cHEImE&amp;clipt=EJiQIRj41CE"
      },
      {
        "title": "In the deep end",
        "description": "From within the bowl, push twice then pump up the side on the left to get a grab grind, then do the same on the other side. The grab grinds you do have to be different, a good way to ensure this is to just use one trigger for the first grind, and the other trigger for the second. You can pop out of the bowl to end the second grind fast, or you can pop and kick the board away to end it as well.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=AKl-c7Dbh41JECYA&amp;clip=UgkxWKhhUJCgKlLosYaCLOx2ZWqppMs4N7Z1&amp;clipt=EJ-LJBjr4SQ"
      },
      {
        "title": "Technically Hip",
        "description": "This is a very simple challenge, all you have to do is two different finger-flips (this include 'varials'/finger-shuvs). Do two quick pushes, and a varial, go back to your session marker and do the same again with a finger-flip.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=39QGSKtYQLF8Tgee&amp;clip=Ugkx_NHyfhdkCDDYPRkCm9-rYKt3oreFQRVS&amp;clipt=ENWMJxiPyCc"
      },
      {
        "title": "Gold Medal Air",
        "description": "Air over the board, if you're struggling to get the height make sure you pump and release as you come up the ramp."
      },
      {
        "title": "PJ Stair Session",
        "description": "Do 3 different flip tricks down the set of stairs. You can set a session marker after 3-4 pushes and still easily clear the stairs. You can also start to warp back to the session marker before you completely land and you will still get the trick, but be careful not to do this to soon or you'll have to do an extra flip trick. Warp back to your marker afterwards so you can go to the start of the next challenge in time for the saving to finish.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=yGR5bLaUzYNc2NMA&amp;clip=UgkxWWrG3Uuq9WN_a9QQxP2M1RmNAhBM6C_l&amp;clipt=EMWFLRjx6C0"
      },
      {
        "title": "Grinding Stairs",
        "description": "Same as the flip tricks, you can set a session marker further forwards during the first attempt to save a little time. You can pop off the rail and kick the board away once you have grinded, be careful that you pop out of a grind in a way that doesn't bail though, for example some flip tricks out of tail/noseslides can cause you to bail."
      },
      {
        "title": "Danny way",
        "description": "This challenge is a big milestone in the run, if you're going for any% you're already a good way done, for career 100% we're just getting started. We don't need to worry too much about score, although it is possible to lose to Danny, especially if we are going slow. We need to make sure we win at least 2 of the runs, so if you notice Danny has won one, you need to pay more attention to your score and ensure you beat him.\nThere are many routes through the megapark, but the sweet spot between fast and consistent is to lose a little speed on the first ramp downwards and come off to the right, then skate round two corners and direct to the finish. If you land in the final bowl area in fakie with a grab, you can turn much tighter into the end area. Try to avoid bailing in to the end on the last run as this will lose a lot of time.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=yWD1igbXbjPZTQ4J&amp;clip=UgkxC23Y8EZfW4NZRMe2FAvmIfDFOvp3_yUB&amp;clipt=EObCMRj76jI"
      },
      {
        "title": "Busenitz Blitz",
        "description": "Simple follow challenge with Busenitz. Make sure when you get to the community pool you are careful not to bail on the stairs, the slope down as he can get away from you. Equally pay attention to if he bailed as you may need to slow yourself down quickly."
      },
      {
        "title": "Shave your tongue",
        "description": "Do the tricks as described, two pushes is good at the start. You can technically do the late flip ahead of the ramp and then land on the ramp but this is much riskier than just doing it on the ramp. Try to slow down a little though so you don't skate as far up the ramp at the end."
      },
      {
        "title": "Creature Style",
        "description": "Another simple follow challenge, try to ensure when you get into the building at the end that you are in front of Darren (or you may struggle to get round him). When you complete the challenge, turn around and run out of the room and go and unlock two nearby pools.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=7zrTATd6Wu0PmLhc&amp;clip=Ugkxohu9jzpRv1QFNs9xJAEbxwYY5TN_9IIs&amp;clipt=EPzgQhjm30Q"
      },
      {
        "title": "Think pink pool",
        "description": "Do two handplants, you can pump and turn after the first one to do the second one very close to where you did the first."
      },
      {
        "title": "Vert with the vampire",
        "description": "Pop into the pool, pump up to the other side and do a one foot grab, pump back to make sure you get enough air up to the windows then slow down to do the tweaked handplant.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=bPCY1gshbCVL1j4Q&amp;clip=UgkxvteGxXf5GUMNcAH8idpTQn9Z5_SQKmfj&amp;clipt=EOnNRxiazUg"
      },
      {
        "title": "Remember this pool?",
        "description": "Simple challenge, skate in the pool and do two airs with a one foot grab or one foot via holding just %x% or %a% in mid-air."
      },
      {
        "title": "Applebutters, eh?",
        "description": "Another simple follow mission, applebutters is probably one of the most consistent follow challenges with very infrequent bails. Although the challenge does only have a 30m/90ft range. Try to land at a slight angle into the landing zone, since if you go forwards with speed you will bail which will lose time on the post mission screens."
      },
      {
        "title": "It's on",
        "description": "Gain points by grinding on the rail, you need at least 900 points to be safe - aim for 1k+ though to be super safe. You can leave a session marker at the location of the challenge start for BLAOW!! during this challenge. If you do, you will need to remember to warp back to it when there is less than 5 seconds left on the clock since your session marker will get cleared on challenge completion and if you go to early you will be warped back into range of it's on."
      },
      {
        "title": "BLAOW!!",
        "description": "Push and pump on the left hand side of the bowl, try to angle so that when you hit the final corner you will be cutting up the bowl at around a 45 degree angle, this should help to maximise the distance and height to make the gap. Afterwards, you can try to grind the coping for the distance, if you don't manage to connect with the coping early though you can warp back to session marker and then skate round to the coping to get the grind from above.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=Nm8oLdehZSVc63nu&amp;clip=Ugkxzzrtl-jNmlrjNFMkUbMd7U5V6yGbQfym&amp;clipt=EPanWRjFzVo"
      },
      {
        "title": "Get blind with Jake",
        "description": "Just push normally for this challenge, don't try to pump, don't try to speed glitch. Doing these will leave you with too much speed and you won't land after the first big gap as you will clear the landing ramp. Try to keep an eye on the traffic at the bottom of the junction, and dodge it if you can, sometimes it's not possible and you will have to go back to the top of the hill. Pump once you hit the downward ramp after the 540 to make sure you get enough height up the final kicker, although the height on that kicker is quite forgiving.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=wH5yypqDk9J6eu8v&amp;clip=UgkxpXPc0dlBK0BLrlOoGp5BFOW_CPBOnTHa&amp;clipt=EJLqXBjUil4"
      },
      {
        "title": "Creativity Rules!",
        "description": "The challenge itself is pretty self-explanatory, do the criteria one by one. You can do two regular pushes before the no comply as long as you tri-push, which should set you up ahead of the pro you're skating with to avoid them getting in your way."
      },
      {
        "title": "The Spice Of Life",
        "description": "Not many tricks here, you can set a session marker slightly further forwards on your first go and reuse that to save a very marginal amount of time. Although be careful with this as if you set it too close it may be difficult to get enough speed and height to make it up the stairs with a flip trick."
      },
      {
        "title": "Over the rainbow",
        "description": "Another simple one, again you can tri push to hit this rail. You need to grind a good amount of the rail for it to count, if you don't grind enough then you will have to take that one again. It seems that due to the curvature of the rail, you lose speed doing nosegrind and gain speed doing 5-0s, so those are recommended. Despite the 'already done' trick counter on the side, you can do the same trick all 3 grinds."
      },
      {
        "title": "Alien Manual Shop",
        "description": "This one will first show up as 'couple of aliens' where you have to watch a short cutscene before you can start the alien manual shop challenge. Make sure you pop in and pop out of every manual, as just rolling off the ledge doesn't count. Also, on the second sequence, be careful you aren't angled towards the edge (to avoid grinding) and aren't hitting the grass too much (to avoid slowing down too much to make the gap)."
      },
      {
        "title": "The Streets are Calling",
        "description": "Do the tricks as suggested, this one is particularly frustrating to fail each part, as any slight mistake means fully restarting the challenge (including skating past the thing you need to skate on or tricking nearby to them). Try to spot pedestrians before you go for the 360 flip and aim away from them if possible.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=7x8xdruiXMu6enhs&amp;clip=Ugkxi4ZFF5Wyp3U0EyK_dT_ynsZO2x7qYoh0&amp;clipt=ELPiaxjw5mw"
      },
      {
        "title": "BS Roll",
        "description": "Simple follow challenge, although be warned this is the most swingy follow challenge in the game. Not only does Brandon like to bail a lot, but also this follow challenge is considerably longer than many of the others."
      },
      {
        "title": "Hit & Bounce",
        "description": "Nothing fancy here, hit each rail and try to make sure you don't bail at the end by landing in the road too straight with too much speed and hitting the kerb."
      },
      {
        "title": "The Clampdown",
        "description": "Hit the rail, you can kick the board away as soon as you have registered a grind and complete the challenge. Pay attention to if any of the Mongo corp guys start chasing you (if you get a red arrow on screen). You can't warp while being chased and will need to either escape the no skate zone, or get kicked out. You can also make use of the additional menus via xbox button or start + select to pause the game while the save spinner happens. This does get rid of the save spinner so you can open the challenge map, but doesn't progress the mongo corp guy's aggro towards you meaning you won't become chased. Alternatively you can just get a fast pause and not worry about being chased.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=l_6YgThdx2o_wHIF&amp;clip=UgkxM-66TsquBQY5GWebjKbfR-GlXtRicVRi&amp;clipt=ELWpexjP7Xw"
      },
      {
        "title": "We Roll Large",
        "description": "Make sure to set a session marker at the top of the center ramp, as a back up in case you need to go again. Then clear and try to land in a way which won't result in you immediately bailing. Pay attention to if you're being chased same as The Clampdown, and employ a strategy to avoid the chase causing you to be unable to warp (either use menu, get the fast pause or escape.)",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=5Dly-i_MSZ_Pi5YB&amp;clip=UgkxJY2PBO4-XYCRDh4yEndBcW-DIPH2kG4M&amp;clipt=ELCEfhjI-X4"
      },
      {
        "title": "High and Dry",
        "description": "Push over to the edge then manual on the floating ledge on the other side of the water, let yourself drop down off this - if you pop then you may gain too much height and bail.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=5a58i6UbUW0x0vwE&amp;clip=UgkxyHbnjPNh-5v57ChRaBUOXevngTlynjo1&amp;clipt=EN3sgAEY1ruBAQ"
      },
      {
        "title": "Lens Flare",
        "description": "Ideally hit a 5-0 on the top section, then a tailslide on the downward slope. If you are struggling with this, it's possible as a back up to set a session marker close and approach very slowly, then just 5-0 to tailslide on the top section alone.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=4C8LyrQJMqMcnnlN&amp;clip=UgkxsnHtT0fxSBDk_D_TMvJwA7_Xr-6ZeQJ0&amp;clipt=EKnwgwEY8KqEAQ"
      },
      {
        "title": "Can you spell Girl?",
        "description": "The most important part of this challenge is knowing that the last screen, unlike every other screen in the game, will retry on an %a% press. This will mean you have to redo this entire 4 minute game of skate and will almost definitely kill your run. So ensure you press the %b% button. In terms of the strategy, there's two ways to guarantee success in this game of skate. The first one is to always do 540 tricks, you can achieve these by doing a footplant after a 360 and continuing the rotation. If you do 5 different 540 tricks you will always win in the minimum amount of time, since the AI do not know how to do 540 tricks and will try to do other random tricks. If you mess up with this somehow and the other skaters get a go. You can skate up the hill and far away so that when you are warped back you get a short loading screen (try to make it across the road up the hill in front of you). This will load another rail back in which causes the AI skaters to just get off their boards at the top of the ramp.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=mKd_EeZl83-pscNG&amp;clip=Ugkx2AvmjSVJks3Q9l-7jg12vabxMNxCf6Hq&amp;clipt=EOmFhwEYireHAQ"
      },
      {
        "title": "Lucas's translation",
        "description": "Starting noseslide on the right side seems to be the most consistent strategy. Make sure you pop out of the other side or it won't count.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=rQncIf0dj9d6pfEv&amp;clip=UgkxFnOdNHXRtwCIfFCOMIA7fOZ1L4gFS5mq&amp;clipt=EIK3lQEYg--VAQ"
      },
      {
        "title": "Stressing with the SOTY",
        "description": "This challenge is pretty brutal, you need to find the right angle to get up and hit the ledge, if you manage to get up to the ledge but don't hit it, you can try to get off your board and then caveman/drop in off the ledge. Once you've hit the high ledge you can then go and hit the lower ledge, be careful not to bail here as you will have to hti the high ledge again.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=CCXXONTVlUzoNPxu&amp;clip=UgkxaqBCBm_TKUnUNa-OQRxWQvZU6PTp4ZhD&amp;clipt=EPGwmQEYiaaaAQ"
      },
      {
        "title": "Loser Gets Hyphy",
        "description": "A very simple challenge, just get more than like 600 points (again aim for 1k+) and then relax for the rest of the minute countdown."
      },
      {
        "title": "Braydon's Ball Blaster",
        "description": "This is really just one long skate in a straight line, so tri-pushing + speed glitches are our friends here. Watch out for the jump in the middle though, if you hit it too fast you will not complete the objective. Try to make sure you get 'Freedom' at the end, if you don't and are being chased, you may need to either skate far away or get knocked out by mongo corp guards to ensure you can warp.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=TlS1Wwwact1S5f5u&amp;clip=UgkxlcN-gfZIZ30EQ-Erp1mMbP4DkUTn35A7&amp;clipt=EKv8ogEY3sqkAQ"
      },
      {
        "title": "Ice Frosty",
        "description": "Another simple points based challenge, one thing you can do during the challenge is try to set a session marker up over near the stairs so we can get to the poop deck pool much quicker.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=g0GS-BxVWmME9dhp&amp;clip=UgkxvnsW_90sYziLi6z8KklN2Uky-X_wsDmM&amp;clipt=ELrGqQEY0ruqAQ"
      },
      {
        "title": "Poop Deck pool",
        "description": "Skate along the boat until you unlock the pool, then ideally score 750 points on the first trick. If you mess this up you should hopefully have enough of a mutliplier to make it quick.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=WHcx28FL_XHDPG2_&amp;clip=UgkxT9I4C-y-Rwd1Bl3cliZvvBLmTuL_fyZi&amp;clipt=EJyBrQEY29avAQ"
      },
      {
        "title": "The Bank Job",
        "description": "This bank is incredibly annoying, any more than a tiny amount of speed causes you to miss the rail/hit the wrong side of it and fail to get back in. Do two very quick mongo pushes and try to angle incredibly shallow so that you don't clear the rail. When you land, try to make sure the mongo guys will knock you out as fast as possible afterwards. Don't go for a fast pause, since you will lose time as you cannot warp while being chased.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=lVcYz1h5u0_xYNnb&amp;clip=UgkxGkrRG8_-_Jcy2NYkI7C2VoDWqrrWktLT&amp;clipt=EK-JtAEYlOy1AQ"
      },
      {
        "title": "Oi! Let's Skate!",
        "description": "Use clever pumping on the left hand quarterpipe, to ensure you can pump up the quarterpipe in front of you with enough speed to handplant.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=sjDvKVpOqm2SLNKq&amp;clip=Ugkx0Vttr63a68hh4zJoyRLLy539p0XhRw-H&amp;clipt=EO_FtwEYr5e4AQ"
      },
      {
        "title": "SOTY Off",
        "description": "Nothing at all special here, just get the points and don't bail/go out of bounds. If you're running the any% route, you can skate down the road at around 5 seconds and you will be within the loading zone of they call it art."
      },
      {
        "title": "Demo",
        "description": "Remember you need to use the phone to pick a pro to begin this - you can't use the phone until the game has finished saving. This challenge is a good opportunity to go to the toilet/get a drink etc. during the demo itself. If you're doing career 100% try to finish the demo next to the starting zone of they call it art."
      },
      {
        "title": "They call it art",
        "description": "This one will require practice to get any type of consistency, normally two pushes is good, try to make your footplant hit as far along the centre ledge as possible so you get maximum distance. You can actually start the challenge early in the same way that fast pausing works if you were next to the challenge start when the demo ended.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=6JdvfHrIDD8BEf1y&amp;clip=UgkxhPPezurReDNWKWHzqr-wOxOJHQEW8BU0&amp;clipt=EOyj0gEY4NjTAQ"
      },
      {
        "title": "Team Films",
        "description": "You can do any 3 films you want here, personally I do Grab Blaster, Flipping One Footers and Inversion Conversion."
      },
      {
        "title": "Dunk Slam",
        "description": "A classic pain-fest challenge, set up the quarterpipe underneath the basket and then pump just before the quarterpipe to hit the handplant. If you hold both analogue sticks to the right after the handplant it tends to have a higher chance of landing successfully. You can use the blue graffiti under the basketball hoop to help with a rough guide of where to place.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=4SZ5MHdZasMmQ1nT&amp;clip=Ugkxyc-KcbCqJKBanldUOozStTx8s-oaGPTP&amp;clipt=EIDm3gEYrpjgAQ"
      },
      {
        "title": "Closing the Circuit",
        "description": "Clear the two gaps, then you can get off your board and jump up on top of the dumpster and set a session marker up there, then grind from above - this drastically reduces the time it would take to move the ramp to set up for the grind.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=QFmjo01k1-X7lZM5&amp;clip=UgkxUawjo2H6Ay6zm-l_v27gEjWqca8UD8PY&amp;clipt=EOCm4gEYxYnkAQ"
      },
      {
        "title": "Double the Grinds",
        "description": "Grind both of the rails, make sure you pop out of both grinds as these rails can sometimes make you just bail at the bottom if you try to ride off them"
      },
      {
        "title": "Shoot the View",
        "description": "Grind along one part of the rail, trick across and then you can immediately pop and kick the board away to finish the challenge sooner"
      },
      {
        "title": "Who lives here?",
        "description": "There's several ways to make this work, it's slightly possible to low pop just enough to actually land on the far side without the ramp. Although this is very hard to replicate. It's also possible to kick the board away just before you land on the far side, this can sometimes count the challenge as completed. Finally you can move the ramp over to land in that as intended - the second strategy of kicking the board away appears more consistent when the ramp is beneath you.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=Fgx9-pnY4jG1SntM&amp;clip=Ugkx9HwaK7JJcEaMBjlsZnegnbjbyPGYC-Kf&amp;clipt=EOiR7QEY9s7tAQ"
      },
      {
        "title": "Car Enthusiast",
        "description": "Do a 5-0 behind the car, then turn it into a tailslide as you go past, pop out once you're past the car and you can kick the board away to end the challenge."
      },
      {
        "title": "The Bowels of MongoCorp",
        "description": "Yet another challenge where we are expected to move objects in the world, instead of doing that you can just run up the stairs and jump between the eagle on your feet to clear the gap.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=E9OeElys6QMN4zuU&amp;clip=Ugkx-7Q3L2da7y6obKLHhfUeDv4IGDx7WSuo&amp;clipt=ELeb9AEYv8L0AQ"
      },
      {
        "title": "Like, skate... whatevs",
        "description": "The infamous run killer itself, there's many strats to this challenge, the simplest being just to move the ramps + rails. The most difficult being YOLO, where you don't move any of the ramps or rails. In order to do YOLO you need to grind the rail, then aim for one of the two kickers and both trick into and out of a grind on the kicker.",
        "videoUrl": "https://www.youtube.com/embed/EqTEYZOnRgs?si=qH3QW-RX8-kxnQM5&amp;clip=UgkxIa9a_yL-59G35rxnEd86BEk5w6irJhqB&amp;clipt=ENeUdhjviXc"
      },
      {
        "title": "Raising Coin",
        "description": "Simple demo, just score the points - don't score too many or you may get a killed it screen"
      },
      {
        "title": "Drop your skills",
        "description": "Can sometimes be a bit painful to do this one, the second balcony often causes you to bail, and since we only have to trick down 3 of the 5 balconies, I opt to avoid tricking on this one and the last one.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=j6xZI-EdZ3LzPMWl&amp;clip=UgkxkPq6iX3x_r8KsQkku5lhh8DL5sZwS6in&amp;clipt=EJrWiQIY9YCLAg"
      },
      {
        "title": "Train Hopping",
        "description": "Clear the gaps, it's easier to set up for another big ollie if you manual inbetween the two gaps. Tri-pushing at the start also makes this challenge quite trivial.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=j8-fNKicn4SZxOrA&amp;clip=Ugkx433qi_SC13V2xhmRAZoFl4m5VlT02R4k&amp;clipt=EO7mjQIYyY-OAg"
      },
      {
        "title": "3rd Set's a Charm",
        "description": "Clear the first set of stairs, then pop into the bank on the right hand side for the second so you can build speed to clear the third set. If you want to avoid killing the challenge you can hippie jump down the entire 3rd set of stairs and guarantee it isn't killed.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=00M-UvxU59D8bGlk&amp;clip=Ugkxt6lPwSjShL7H4zU4etbT9vDMb1cDn8MS&amp;clipt=EJ3KkAIYtb-RAg"
      },
      {
        "title": "The Scene of The crime",
        "description": "Thankfully this last challenge is simple, just do a 540 into the dam, it's easier and slightly quicker to just turn around and do it off the left hand side.",
        "videoUrl": "https://www.youtube.com/embed/psaD5m4olRs?si=_fJLnMPtJw6vZgAm&amp;clip=UgkxgJC41-JdfDYzKVzxDuAll3JRGH2wf1UR&amp;clipt=ELyRlAIYl7qUAg"
      }
    ]
  }
]
